In [160]:
import pandas as pd

In [161]:
loc = 'c:/Users/My/Desktop/'
loc = loc + '19.csv'
n = pd.read_csv(loc, names = ["Name", "Gender", "Branch", "phone"])
n.head(5)

                   Name Gender Branch                         phone
0          SWATI MANDAL      F    EEE                 94255 - 85238
1      ANKIT NIRMALAKAR      M    EEE                 96306 - 73988
2  SOUMYADYUTI MAJUMDAR      M    EEE                    9770770909
3        PRINCE AGRAWAL      M    EEE  94067 - 47153 94253 -\n44091
4       NAWAZISH SULTAN      M    EEE  98264 - 57486 98269 -\n68939

In [162]:
num = n[n.columns[3]]
num.head(5)

0                   94255 - 85238
1                   96306 - 73988
2                      9770770909
3    94067 - 47153 94253 -\n44091
4    98264 - 57486 98269 -\n68939
Name: phone, dtype: object

In [163]:
for i in range(num.size):
    num[i] = num[i].replace(",","") #if two number are present
    b = num[i].split(" ")   #if space is present between them
    if len(b)>=3 :
        num[i]  = b[0]+b[2]
        if num[i][0] == 0:
            num[i] = num[i].lstrip('0')

In [164]:
n[n.columns[3]] = num
n.head(5)

                   Name Gender Branch       phone
0          SWATI MANDAL      F    EEE  9425585238
1      ANKIT NIRMALAKAR      M    EEE  9630673988
2  SOUMYADYUTI MAJUMDAR      M    EEE  9770770909
3        PRINCE AGRAWAL      M    EEE  9406747153
4       NAWAZISH SULTAN      M    EEE  9826457486

In [165]:
n.to_csv('out12.csv')